<h1 style ="font-size:5rem;color:grey;">EDA Using 'Pandas'</h1>

In [ ]:
import pandas as pd
import numpy as np

In [5]:
dict1 ={'Name':['Archana','Abhishek','Ayush','Atharv','Utkarsh','Krishna','Radhika'],
                'Marks':[94,np.nan,101,102,83,99,np.nan],
                'Gender':['Female','Male','Male','Male','Male','Male','Female'],
                'Email':['Archana@gmail.com','Abhishek@gmail.com','Ayush@gmail.com','Atharv@yahoo.com','Utkarsh@hotmail.com','Krishna@yahoo.com','Radhika@yahoo.com'],
                'class':['10th', '11th', '12th', '5th', '8th', '9th', '12th']
               }
df1=pd.DataFrame(dict1)
df1

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

## 1. Top rows() of the dataset

In [7]:
df1.head()

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th

## 2. Top 3 rows() of the dataset

In [9]:
df1.head(3)

       Name  Marks  Gender               Email class
0   Archana   94.0  Female   Archana@gmail.com  10th
1  Abhishek    NaN    Male  Abhishek@gmail.com  11th
2     Ayush  101.0    Male     Ayush@gmail.com  12th

## 3. Last rows() of the dataset

In [10]:
df1.tail()

      Name  Marks  Gender                Email class
2    Ayush  101.0    Male      Ayush@gmail.com  12th
3   Atharv  102.0    Male     Atharv@yahoo.com   5th
4  Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5  Krishna   99.0    Male    Krishna@yahoo.com   9th
6  Radhika    NaN  Female    Radhika@yahoo.com  12th

## 4. Last 3 rows() of the dataset

In [11]:
df1.tail(3)

      Name  Marks  Gender                Email class
4  Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5  Krishna   99.0    Male    Krishna@yahoo.com   9th
6  Radhika    NaN  Female    Radhika@yahoo.com  12th

# 5. All rows except the last 2 rows

In [12]:
df1.head(-2)

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th

# 6. All the rows except the first 3 rows

In [13]:
df1.tail(-3)

      Name  Marks  Gender                Email class
3   Atharv  102.0    Male     Atharv@yahoo.com   5th
4  Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5  Krishna   99.0    Male    Krishna@yahoo.com   9th
6  Radhika    NaN  Female    Radhika@yahoo.com  12th

# 7. Find the shape of our dataset

In [15]:
df1.shape

(7, 5)

In [18]:
print("Number of rows =", df1.shape[0])
print("Number of columns =", df1.shape[1])

Number of rows = 7
Number of columns = 5

# 8. Find the shape of one series in our dataset

In [20]:
df1['Marks'].shape

(7,)

# 9. Get the information of our whole dataset

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
 4   class   7 non-null      object
dtypes: float64(1), object(4)
memory usage: 408.0+ bytes

# 10. Check null values in our dataset

In [24]:
df1.isnull()

    Name  Marks  Gender  Email  class
0  False  False   False  False  False
1  False   True   False  False  False
2  False  False   False  False  False
3  False  False   False  False  False
4  False  False   False  False  False
5  False  False   False  False  False
6  False   True   False  False  False

In [23]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
class     0
dtype: int64

# 11. Get overall statistics about the dataset

In [25]:
df1.describe()

           Marks
count    5.00000
mean    95.80000
std      7.79102
min     83.00000
25%     94.00000
50%     99.00000
75%    101.00000
max    102.00000

In [26]:
df1.describe(include='all')

           Name      Marks Gender              Email class
count         7    5.00000      7                  7     7
unique        7        NaN      2                  7     6
top     Archana        NaN   Male  Archana@gmail.com  12th
freq          1        NaN      5                  1     2
mean        NaN   95.80000    NaN                NaN   NaN
std         NaN    7.79102    NaN                NaN   NaN
min         NaN   83.00000    NaN                NaN   NaN
25%         NaN   94.00000    NaN                NaN   NaN
50%         NaN   99.00000    NaN                NaN   NaN
75%         NaN  101.00000    NaN                NaN   NaN
max         NaN  102.00000    NaN                NaN   NaN

# 12. Find the unique values from the gender column

In [27]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email', 'class'], dtype='object')

In [29]:
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [31]:
df1['Gender'].nunique()

2

In [32]:
df1.nunique()

Name      7
Marks     5
Gender    2
Email     7
class     6
dtype: int64

In [34]:
df1['Gender'].value_counts()

Male      5
Female    2
Name: Gender, dtype: int64

# 13. Find the marks B/w 80 to 90

In [37]:
(df1['Marks']>=80) & (df1['Marks']<=90)

0    False
1    False
2    False
3    False
4     True
5    False
6    False
Name: Marks, dtype: bool

In [41]:
sum((df1['Marks']>=80) & (df1['Marks']<=90))

1

# 14. Name of the student with lowest marks

In [42]:
df1.Marks.min()

83.0

In [44]:
df1['Marks'].min()

83.0

# 15. Top 5 students by their marks

In [60]:
df1.nlargest(5, 'Marks') [['Name', 'Marks']]

      Name  Marks
3   Atharv  102.0
2    Ayush  101.0
5  Krishna   99.0
0  Archana   94.0
4  Utkarsh   83.0

In [66]:
df1.sort_values(by='Marks', ascending=False).head() [['Name','Marks']]

      Name  Marks
3   Atharv  102.0
2    Ayush  101.0
5  Krishna   99.0
0  Archana   94.0
4  Utkarsh   83.0

# 16. Find the Avg Marks

In [68]:
df1.Marks.min()

83.0

In [69]:
df1.Marks.mean()

95.8

In [71]:
df1.Marks.median()

99.0

In [72]:
df1.Marks.max()

102.0

# 17. Find the half marks of the students

In [82]:
def marks(x):
 return x//2

df1.Marks.apply(marks)

0    47.0
1     NaN
2    50.0
3    51.0
4    41.0
5    49.0
6     NaN
Name: Marks, dtype: float64

# 18. Sort the dataframe as per the marks column (By default ASC)

In [83]:
df1.sort_values(by='Marks')

       Name  Marks  Gender                Email class
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
0   Archana   94.0  Female    Archana@gmail.com  10th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

In [86]:
df1.sort_values(by='Marks', ascending=False)

       Name  Marks  Gender                Email class
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
0   Archana   94.0  Female    Archana@gmail.com  10th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

# 19. Display name & marks of the female students

In [92]:
df1[df1.Gender=='Female'][['Name','Marks']]

      Name  Marks
0  Archana   94.0
6  Radhika    NaN

In [97]:
df1[df1.Gender.isin(['Female'])][['Name','Marks']]

      Name  Marks
0  Archana   94.0
6  Radhika    NaN

# 20. Rename the marks columns

In [99]:
df1.rename(columns={'Marks':"Final_Marks"})

       Name  Final_Marks  Gender                Email class
0   Archana         94.0  Female    Archana@gmail.com  10th
1  Abhishek          NaN    Male   Abhishek@gmail.com  11th
2     Ayush        101.0    Male      Ayush@gmail.com  12th
3    Atharv        102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh         83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna         99.0    Male    Krishna@yahoo.com   9th
6   Radhika          NaN  Female    Radhika@yahoo.com  12th

In [100]:
df1.rename(columns={'Final_Marks':'Marks'})

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

# 21. Selecting a range of rows from the DataFrame

# loc & iloc

In [114]:
df1.loc[:]

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

In [115]:
df1.loc[:, 'Name']

0     Archana
1    Abhishek
2       Ayush
3      Atharv
4     Utkarsh
5     Krishna
6     Radhika
Name: Name, dtype: object

In [116]:
df1.loc[0:3, 'Name']

0     Archana
1    Abhishek
2       Ayush
3      Atharv
Name: Name, dtype: object

In [118]:
df1.loc[0:3]

       Name  Marks  Gender               Email class
0   Archana   94.0  Female   Archana@gmail.com  10th
1  Abhishek    NaN    Male  Abhishek@gmail.com  11th
2     Ayush  101.0    Male     Ayush@gmail.com  12th
3    Atharv  102.0    Male    Atharv@yahoo.com   5th

In [119]:
df1.iloc[0:3,0:4]

       Name  Marks  Gender               Email
0   Archana   94.0  Female   Archana@gmail.com
1  Abhishek    NaN    Male  Abhishek@gmail.com
2     Ayush  101.0    Male     Ayush@gmail.com

In [120]:
df1.iloc[:]

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

In [122]:
df1.iloc[0:1,3]

0    Archana@gmail.com
Name: Email, dtype: object

# 22.Find the higest avg value as per gender

In [131]:
df1.groupby('Gender')['Marks'].mean().sort_values

<bound method Series.sort_values of Gender
Female    94.00
Male      96.25
Name: Marks, dtype: float64>

In [136]:
type(df1.groupby('Gender')['Marks'].mean().sort_values)

method

# 23. Handling missing values

In [138]:
df1.dropna()

      Name  Marks  Gender                Email class
0  Archana   94.0  Female    Archana@gmail.com  10th
2    Ayush  101.0    Male      Ayush@gmail.com  12th
3   Atharv  102.0    Male     Atharv@yahoo.com   5th
4  Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5  Krishna   99.0    Male    Krishna@yahoo.com   9th

In [139]:
df1

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

In [140]:
df1.dropna(how='all')

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    NaN    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    NaN  Female    Radhika@yahoo.com  12th

In [141]:
df1.dropna(how='any')

      Name  Marks  Gender                Email class
0  Archana   94.0  Female    Archana@gmail.com  10th
2    Ayush  101.0    Male      Ayush@gmail.com  12th
3   Atharv  102.0    Male     Atharv@yahoo.com   5th
4  Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5  Krishna   99.0    Male    Krishna@yahoo.com   9th

In [142]:
df1.fillna(0)

       Name  Marks  Gender                Email class
0   Archana   94.0  Female    Archana@gmail.com  10th
1  Abhishek    0.0    Male   Abhishek@gmail.com  11th
2     Ayush  101.0    Male      Ayush@gmail.com  12th
3    Atharv  102.0    Male     Atharv@yahoo.com   5th
4   Utkarsh   83.0    Male  Utkarsh@hotmail.com   8th
5   Krishna   99.0    Male    Krishna@yahoo.com   9th
6   Radhika    0.0  Female    Radhika@yahoo.com  12th

In [146]:
df1.Marks.fillna(df1['Marks'].median())

0     94.0
1     99.0
2    101.0
3    102.0
4     83.0
5     99.0
6     99.0
Name: Marks, dtype: float64

In [147]:
df1.Marks.fillna(df1['Marks'].mean())

0     94.0
1     95.8
2    101.0
3    102.0
4     83.0
5     99.0
6     95.8
Name: Marks, dtype: float64